; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Description
;;; ------------
;;; A manipulator works in an environment in
;;; which it might be obstructed. If obstructed
;;; it needs to handle the obstruction first.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain MANIPULATOR)
  (:requirements :strips :typing)
  (:types manipulator			;This is the robot that can be controlled
	  block				;This is the object that is supposed to be manipulated
	  obstruction			;This is an object that should not be here
	  location			;Location at which obstruction is safe
  )

  (:predicates (m-at ?m - manipulator ?l - location)
	       (holding-o ?m - manipulator ?o - obstruction)
	       (o-at ?o - obstruction ?l - location)
 	       (holding-b ?m - manipulator ?b - block)
	       (b-at ?b - block ?l - location)
	       (empty ?m - manipulator)
	       (safe ?l - location)
  )

  (:action move
	     :parameters (?m - manipulator ?from ?to - location)
	     :precondition (m-at ?m ?from)
	     :effect
		(and (m-at ?m ?to)
		(not(m-at ?m ?from)))
  )


  (:action pick-up-obstr
	     :parameters (?m - manipulator ?o - obstruction ?l - location)
	     :precondition (and (m-at ?m ?l)(o-at ?o ?l)(empty ?m))
	     :effect
		(and (holding-o ?m ?o)
		(not(empty ?m))
		(not(o-at ?o ?l)))
  )

  (:action put-down-obstr
	     :parameters (?m - manipulator ?o - obstruction ?l - location)
	     :precondition (and (m-at ?m ?l)(holding-o ?m ?o))
	     :effect
	        (and (empty ?m)
		(not(holding-o ?m ?o))
		(o-at ?o ?l))
  )

  (:action pick-up-block
	     :parameters (?m - manipulator ?b - block ?o - obstruction ?l1 ?l2 - location)
	     :precondition (and (m-at ?m ?l1)(b-at ?b ?l1)(safe ?l2)(o-at ?o ?l2)(empty ?m))
	     :effect
		(and (holding-b ?m ?b)
		(not(b-at ?b ?l))
		(not(empty ?m)))
  )

)

; problem
(define (problem MANIPULATOR-1)

(:domain MANIPULATOR)
(:objects
	  B - block
	  O - obstruction
	  M - manipulator
	  L1 L2 - location)

(:init
	  (m-at M L1)
  	  (b-at B L2)
  	  (o-at O L2)
  	  (safe L1)
  	  (empty M)
)

(:goal 
	  (holding-b M B)
)
)

; plan
1. (move m l1 l2)
   deleted: (m-at m l1)
   added: (m-at m l2)
   goals met: 0 of 1
2. (pick-up-obstr m o l2)
   deleted: (empty m) (o-at o l2)
   added: (holding-o m o)
   goals met: 0 of 1
3. (move m l2 l1)
   deleted: (m-at m l2)
   added: (m-at m l1)
   goals met: 0 of 1
4. (put-down-obstr m o l1)
   deleted: (holding-o m o)
   added: (empty m) (o-at o l1)
   goals met: 0 of 1
5. (move m l1 l2)
   deleted: (m-at m l1)
   added: (m-at m l2)
   goals met: 0 of 1
6. (pick-up-block m b o l2 l1)
   deleted: (empty m)
   added: (holding-b m b)
   goals met: 1 of 1
